Алгоритмы поиска: 
- Линейный поиск
- бинарный поиск
- граф и поиск в ширину (найти путь от а до б за минимальное кол-во шагов)
- Интерполирующий поиск

Алгоритмы сортировки:
- Сортировка выбором
- пузырьком (не эффективаня)
- быстрая сортировка (эффективаня)
- сортировка слиянием
- сортировка вставками
- сортировка подсчётом
- сортировка расчёской
- сортировка перемешиванием

Структуры данных: 
- Очередь (fifo)
- Стек (lifo)
- Связный список (список узлов и ссылок или указателей) (Linked List)
- Множества
- Map
- Хеш-таблица
- Двоичное дерево поиска
- Двоичная куча
- Граф
- Нагруженное (префиксное) дерево