// Абстрактные классы

// не может использоваться для создания объекта напрямую

// используется только как родительский класс

// может содержать реализацию для некоторых методов

// реализованные методы могут ссылаться на другие методы, которых на самом деле ещё не существует (нам все же нужно указать имена и типы для нереализованных методов)

// может заставить дочерние классы пообещать реализовывать какой-то другой метод

// ========================================================================================================================

// Разница interface и abstract classes